Revit 2027 API
IFCRange(Double, Double) Constructor
 Instantiates an IFCRange object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCRange(
	double start,
	double end
)
Public Sub New (
	start As Double,
	end As Double
)
public:
IFCRange(
	double start,
	double end
)
new :
        start : float *
        end : float -> IFCRange
Parameters
start Double
 The starting value of the range.
end Double
 The ending value of the range.
See Also
Reference
IFCRange Class
IFCRange Overload
Autodesk.Revit.DB.IFC Namespace